In [1]:
# series 最重要的一个功能,它就是会根据运算的索引标签自动对齐数据.

import pandas as pd 
import numpy as np
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000
, 'Utah': 5000}
obj3 = pd.Series(sdata)

In [2]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [3]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4  = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [4]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [6]:
obj4.name = 'population'
obj4.index.name = 'state'

In [7]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [11]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [13]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [14]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [23]:
pd.DataFrame(data,columns=[ 'state', 'pop','a']).isnull()

   state    pop     a
0  False  False  True
1  False  False  True
2  False  False  True
3  False  False  True
4  False  False  True
5  False  False  True

In [26]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
....: index=['one', 'two', 'three', 'four',
....: 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [27]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [28]:
# 选取列的方式
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [29]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [30]:
# 选取第三行的内容
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [32]:
frame2['debt'] = 7
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     7
two    2001    Ohio  1.7     7
three  2002    Ohio  3.6     7
four   2001  Nevada  2.4     7
five   2002  Nevada  2.9     7
six    2003  Nevada  3.2     7

In [37]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [39]:
# 将列表或数组赋值给某个列时，其长度必须跟DataFrame的长度相匹配。如果赋值
# 的是一个Series，就会精确匹配DataFrame的索引，所有的空位都将被填上缺失
# 值

val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four'
, 'five'])
frame2['debt']  = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [41]:
# 为不存在的列赋值会产生一个新列,关键字del 用于删除列
frame2 ['baixi'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  baixi
one    2000    Ohio  1.5   NaN   True
two    2001    Ohio  1.7  -1.2   True
three  2002    Ohio  3.6   NaN   True
four   2001  Nevada  2.4  -1.5  False
five   2002  Nevada  2.9  -1.7  False
six    2003  Nevada  3.2   NaN  False

In [42]:
del frame2 ['baixi']

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [ ]:
# 下一章,学习数据套字典,先不急.